[
  "Cats sleep 70% of their lives.",
  "A group of cats is called a clowder.",
  "Cats can rotate their ears 180 degrees.",
  "The first cat in space was a French cat named Félicette in 1963.",
  "Cats have over 20 muscles that control their ears.",
  "A cat can jump up to six times its length in one leap.",
  "Cats have a specialized collarbone that allows them to always land on their feet.",
  "Adult cats only meow to communicate with humans, not other cats.",
  "A cat’s nose print is as unique as a human fingerprint.",
  "Cats can run up to 30 mph (48 km/h).",
  "Domestic cats share 95.6% of their DNA with tigers.",
  "Cats can make over 100 different sounds.",
  "The oldest known pet cat was found in a 9,500-year-old grave on Cyprus.",
  "A cat’s whiskers are about as wide as its body to help measure spaces.",
  "Cats can’t taste sweetness.",
  "The world’s richest cat inherited $13 million.",
  "Cats spend about one-third of their waking hours grooming themselves.",
  "A cat’s purr can help heal bones and tissues.",
  "Cats have a third eyelid called a haw.",
  "Isaac Newton is credited with inventing the cat door.",
  "The oldest cat ever recorded lived to be 38 years old.",
  "Cats’ back paws have fewer toes than their front paws.",
  "A house cat’s genome is 95.6% tiger.",
  "Cats can dream, just like humans.",
  "Cats use their tails to maintain balance.",
  "The average cat weighs between 5 and 20 pounds.",
  "The largest domestic cat breed is the Maine Coon.",
  "Cats have a Jacobson’s organ to detect pheromones.",
  "Cats can squeeze through openings as small as their heads.",
  "A cat’s heart beats nearly twice as fast as a human’s.",
  "Cats have better night vision than dogs.",
  "Some cats are allergic to humans.",
  "The first cat show was held in London in 1871.",
  "A cat’s tongue is covered with tiny hooks called papillae.",
  "Cats can jump about seven times their tail length.",
  "A cat’s brain is 90% similar to a human’s.",
  "The world’s longest cat measured over 48 inches.",
  "Cats can rotate their front paws inward.",
  "Male cats are more likely to be left-pawed.",
  "Female cats are more likely to be right-pawed.",
  "Cats can detect earthquakes before humans.",
  "Cats sweat only through their paws.",
  "Cats can’t climb down headfirst without twisting their bodies.",
  "The Egyptian Mau is one of the fastest domestic cats.",
  "Cats use their whiskers to detect changes in air currents.",
  "Cats can hear ultrasonic sounds that humans cannot.",
  "Cats mark their territory by rubbing scent glands on objects.",
  "Kittens open their eyes about 7 to 10 days after birth.",
  "Cats have five toes on their front paws but only four on the back.",
  "Some cats have extra toes, a condition called polydactylism.",
  "Cats can survive falls from high places thanks to their righting reflex.",
  "A cat’s purr frequency is between 25 and 150 Hertz.",
  "Cats can recognize their own names but may choose to ignore you.",
  "A cat’s fur pattern is unique like a fingerprint.",
  "Cats are obligate carnivores and need meat to survive.",
  "Cats spend about 15 hours a day sleeping.",
  "Some cats like to play fetch just like dogs.",
  "Cats use their tails to communicate mood.",
  "Cats can rotate their heads more than dogs.",
  "Cats can detect scents about 14 times better than humans.",
  "Cats are nearsighted but have excellent peripheral vision.",
  "Cats can drink seawater to stay hydrated.",
  "Cats were worshipped in ancient Egypt.",
  "Black cats are considered good luck in Japan.",
  "Cats can jump onto high shelves with ease.",
  "Cats have been kept as pets for over 4,000 years.",
  "A cat’s sense of hearing is among the best of all mammals.",
  "Cats communicate through body language and tail position.",
  "The average cat lives 12 to 15 years.",
  "Cats can rotate their eyes independently in low light.",
  "Cats can run faster than Usain Bolt over short distances.",
  "Cats have been featured in art for thousands of years.",
  "Cats are lactose intolerant despite loving milk.",
  "Cats can mimic the cry of a human baby to get attention.",
  "Cats knead with their paws to mark territory and comfort themselves.",
  "A cat’s whiskers are so sensitive they can detect tiny movements of air.",
  "Cats have a unique grooming pattern called the “lick sequence.”",
  "Cats have flexible spines that help them twist in midair.",
  "Cats can remember locations of hidden food for long periods.",
  "Cats can rotate their hind legs more than most animals.",
  "Cats can be trained with positive reinforcement.",
  "Cats may bring gifts (like dead animals) to their owners.",
  "Cats often use slow blinking to show affection.",
  "Cats can sense changes in barometric pressure.",
  "Cats can jump up to 8 feet vertically.",
  "Cats can survive on very little water by concentrating urine.",
  "Cats have fewer taste buds than dogs.",
  "Cats can learn their owner’s schedule.",
  "Cats can rotate their ears separately for better hearing.",
  "Cats’ noses have 200 million scent receptors.",
  "Cats can sleep in a sitting position using their tail for balance.",
  "Cats can remember human faces for years.",
  "Cats’ eyes glow in the dark because of a layer called the tapetum lucidum.",
  "Cats can be left-pawed, right-pawed, or ambidextrous.",
  "Cats can detect human emotions through voice and scent.",
  "Cats can tolerate higher body temperatures than humans.",
  "Cats can smell food from long distances.",
  "Cats are more active during dawn and dusk (crepuscular).",
  "Cats can communicate with over 16 different vocalizations.",
  "Cats can jump five times their own height.",
  "Cats have a natural hunting instinct even when domesticated."
]
